---
kind: method
id: M:Autodesk.Revit.DB.IPerformanceAdviserRule.GetDescription
source: html/9b851993-4910-2052-7f5e-791952b0e96a.htm
---
# Autodesk.Revit.DB.IPerformanceAdviserRule.GetDescription Method

Retrieves the description of the rule.

## Syntax (C#)
```csharp
string GetDescription()
```

## Returns
The description of the rule.

## Remarks
Method should return a brief (one-two sentences) description of the rule. String should be localized.